---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.ReverseIterator
source: html/b9688ea8-f87a-c401-39b2-462ead4ecd16.htm
---
# Autodesk.Revit.DB.ParameterMap.ReverseIterator Method

Retrieve a backward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual ParameterMapIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the map.